/*

题目描述
现代数学的著名证明之一是Georg Cantor证明了有理数是可枚举的。他是用下面这一张表来证明这一命题的：

1/11/1 , 1/21/2 , 1/31/3 , 1/41/4, 1/51/5, …

2/12/1, 2/22/2 , 2/32/3, 2/42/4, …

3/13/1 , 3/23/2, 3/33/3, …

4/14/1, 4/24/2, …

5/15/1, …

… 我们以ZZ字形给上表的每一项编号。第一项是1/11/1，然后是1/21/2，2/12/1，3/13/1，2/22/2，…

输入输出格式
输入格式：
整数NN（1≤N≤100000001≤N≤10000000）

输出格式：
表中的第NN项

输入输出样例
输入样例#1： 
7
输出样例#1： 
1/4


思路:
    一定要看清楚顺序，和更新的方向

*/
#include <iostream>
using namespace std;

int main() {
    int n;
    cin >> n;
    int up = 1, btm = 1, d = 1;
    for (int i = 1; i < n; i++) {
        if (up == 1 && d == 1) {
            btm += 1;
            d = -1;
        } else if (btm == 1 && d == -1) {
            up += 1;
            d = 1;
        } else {
            up -= d;
            btm += d;
        }
    }
    cout << up << '/' << btm << endl;
    return 0;
}